#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
data.azurerm_linux_web_app.app_backend_li: Still reading... [10s elapsed]
data.azurerm_linux_web_app.weu_session_manager: Still reading... [10s elapsed]
data.azurerm_redis_cache.redis_common: Still reading... [10s elapsed]
data.azurerm_linux_web_app.app_backend_li: Still reading... [20s elapsed]
data.azurerm_linux_web_app.weu_session_manager: Still reading... [20s elapsed]
data.azurerm_redis_cache.redis_common: Still reading... [20s elapsed]
data.azurerm_redis_cache.redis_common: Still reading... [30s elapsed]
data.azurerm_redis_cache.redis_common: Still reading... [40s elapsed]
data.azurerm_redis_cache.redis_common: Still reading... [50s elapsed]
data.azurerm_redis_cache.redis_common: Still reading... [1m0s elapsed]
module.function_lollipop_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_lv_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_lollipop_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]
module.function_lv_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]
module.function_session_manager_internal_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_session_manager_internal_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]
module.function_profile_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_profile_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]
module.function_profile_async_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_profile_async_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_servicebus_subscription.io_auth_sub will be created
  + resource "azurerm_servicebus_subscription" "io_auth_sub" {
      + auto_delete_on_idle                       = (known after apply)
      + batched_operations_enabled                = (known after apply)
      + client_scoped_subscription_enabled        = false
      + dead_lettering_on_filter_evaluation_error = true
      + default_message_ttl                       = (known after apply)
      + enable_batched_operations                 = (known after apply)
      + id                                        = (known after apply)
      + lock_duration                             = (known after apply)
      + max_delivery_count                        = 10
      + name                                      = "io-auth-sub"
      + status                                    = "Active"
      + topic_id                                  = (known after apply)
    }

  # azurerm_servicebus_subscription_rule.session_events_filter will be created
  + resource "azurerm_servicebus_subscription_rule" "session_events_filter" {
      + filter_type                    = "SqlFilter"
      + id                             = (known after apply)
      + name                           = "io-auth-session-events-filter"
      + sql_filter                     = "eventType IN ('login','logout')"
      + sql_filter_compatibility_level = (known after apply)
      + subscription_id                = (known after apply)
    }

  # azurerm_servicebus_topic.io_auth_sessions_topic will be created
  + resource "azurerm_servicebus_topic" "io_auth_sessions_topic" {
      + auto_delete_on_idle                     = (known after apply)
      + batched_operations_enabled              = (known after apply)
      + default_message_ttl                     = (known after apply)
      + duplicate_detection_history_time_window = (known after apply)
      + enable_batched_operations               = (known after apply)
      + enable_express                          = (known after apply)
      + enable_partitioning                     = (known after apply)
      + express_enabled                         = (known after apply)
      + id                                      = (known after apply)
      + max_message_size_in_kilobytes           = (known after apply)
      + max_size_in_megabytes                   = (known after apply)
      + name                                    = "io-auth-sessions-topic"
      + namespace_id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01"
      + partitioning_enabled                    = (known after apply)
      + status                                  = "Active"
    }

  # module.pub_session_manager.module.service_bus.azurerm_role_assignment.topics["/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01|io-auth-sessions-topic|writer"] will be created
  + resource "azurerm_role_assignment" "topics" {
      + description                      = "This role allows managing the given topic"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "1c3e0031-ab30-4fa8-8b39-18bf4b02e35d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Service Bus Data Sender"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01/topics/io-auth-sessions-topic"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sub_io_prof_async.module.service_bus.azurerm_role_assignment.subscriptions["/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01|io-auth-topic|io-auth-sub|reader"] will be created
  + resource "azurerm_role_assignment" "subscriptions" {
      + description                      = "This role allows receiving messages from the given subscription"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c60e62e1-05cb-43d0-a958-9b75153184d2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Service Bus Data Receiver"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01/topics/io-auth-topic/subscriptions/io-auth-sub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.topic_io_auth.module.service_bus.azurerm_role_assignment.subscriptions["/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01|io-auth-topic|io-auth-sub|owner"] will be created
  + resource "azurerm_role_assignment" "subscriptions" {
      + description                      = "This role allows managing the given subscription"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0bd8a47e-3188-45c9-9c74-23f22fca2497"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Service Bus Data Owner"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01/topics/io-auth-topic/subscriptions/io-auth-sub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.topic_io_auth.module.service_bus.azurerm_role_assignment.topics["/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01|io-auth-sessions-topic|owner"] will be created
  + resource "azurerm_role_assignment" "topics" {
      + description                      = "This role allows managing the given topic"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0bd8a47e-3188-45c9-9c74-23f22fca2497"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Service Bus Data Owner"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01/topics/io-auth-sessions-topic"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
